export default [
  {
    text: 'Что является текстовым редактором?',
    answers: [
      'Paint',
      'Word',
      'Calculator',
      'OpenOffice Calc',
    ],
    answer: 1,
  },
  {
    text: 'В какой системе число не может иметь следующий вид: <code>10210121</code>?',
    answers: [
      'Двоичной',
      'Десятичной',
      'Шестнадцатеричной',
      'Троичной',
    ],
    answer: 0,
  },
  {
      text: 'Что такое файл?',
      answers: [
        'Программа, хранящаяся на компьютере',
        'Минимальная единица хранения информации',
        'Информация, хранящаяся в долговременной памяти как единое целое и обозначенная именем',
        'Путь от папки или архива до жёсткого диска',
      ],
      answer: 2,
  },
  {
      text: 'Расширения <code>txt</code>, <code>rtf</code>, <code>doc</code> характерны для',
      answers: [
        'графических файлов',
        'видеофайлов',
        'текстовых файлов',
        'электронных таблиц',
      ],
      answer: 2,
  },
  {
      text: 'Высказывание <code>Все собаки&nbsp;лают</code>:',
      answers: [
        'Истинно',
        'Ложно',
        'Можно рассмотреть как истинное, так и ложное',
        'Не является высказыванием',
      ],
      answer: 0,
  },
  {
      text: 'Истинное высказывание: <code>cos&nbsp;180°&nbsp;=&nbsp;-1</code> является высказыванием из',
      answers: [
        'Физики',
        'Бравл Старс',
        'Жизни',
        'Алгебры',
      ],
      answer: 3,
  },
  {
      text: 'Что является языком программирования?',
      answers: [
        'Gazelle',
        'Hedgehog',
        'Python',
        'Tiger',
      ],
      answer: 2,
  },
  {
      text: 'Что из повседневной жизни вы можете встретить на уроках информатики?',
      answers: [
        'Дерево',
        'Камень',
        'Аркадия Паровозова',
        'Куст',
      ],
      answer: 0,
  },
  {
      text: 'Лёгкий вопрос: Что есть в ПК?',
      answers: [
        'Монометр',
        'Процессор',
        'ВСУ',
        'Управляющие стержни реактора РБМК-1000',
      ],
      answer: 1,
  },
  {
      text: 'Чего вы не встретите в электронной таблице?',
      answers: [
        'Ячеек',
        'Столбцов',
        'Матриц',
        'Рекурсий',
      ],
      answer: 3,
  },
  {
      text: 'Знания какого языка помогают проще освоить программирование?',
      answers: [
        'Русского',
        'Арабского',
        'Английского',
        'Казахского',
      ],
      answer: 2,
  },
  {
      text: 'Что из этого является ОС?',
      answers: [
        'Linux',
        'Windous',
        'MIOS',
        'Androeed',
      ],
      answer: 0,
  },
  {
      text: 'Цикл - это',
      answers: [
        'Обособленный кусок кода, инициирующий многократное повторение каких-то действий внутри него определённое число раз или вплоть до выполения необходимых условий для выхода из куска кода',
        'логическое ветвление',
        'Обособленный кусок кода, который можно вызывать из другой части программы',
        'Выведение информации в консоль',
      ],
      answer: 0,
  },
  {
      text: 'Зачем нужна блок-схема?',
      answers: [
        'Даёт логическое представление о работе программы',
        'Позволяет визуализировать работу алгоритма',
        'Позволяет усложнить существующий алгоритм ',
        'Даёт письменную характеристику о работе программы',
      ],
      answer: 1,
  },
  {
      text: 'Робот-пылесос является',
      answers: [
        'Исполнителем',
        'Формальным исполнителем',
        'Алгоритмическим исолнителем',
        'Разработчиком алгоритма',
      ],
      answer: 1,
  },
  {
      text: 'Иван набирал текст. Вдруг все буквы стали выводиться заглавными. Что произошло?',
      answers: [
        'компьютер взломали злоумышленнки',
        'была случайно нажата клавиша Caps Lock',
        'Была случайно нажата клавиша Backspace',
        'Текстовый реактор перестал отвечать',
      ],
      answer: 1,
  },
  {
      text: 'В какую степень надо возвести <code>2</code>, чтобы получить <code>128</code>?',
      answers: [
        'во вторую',
        'в шестую',
        'в седьмую',
        'в десятую',
      ],
      answer: 2,
  },
  {
      text: 'Что из нижеперечисленного является устройством ввода информации в ПК?',
      answers: [
        'Клавиатура',
        'Наушники',
        'Процессор',
        'Принтер',
      ],
      answer: 0,
  },
  {
      text: 'Когда возможна ситуация <code>А&nbsp;->&nbsp;В&nbsp;=&nbsp;0</code>?',
      answers: [
        'при А = 0 и В = 1',
        'при А = 1 и В = 0',
        'при А = 0 и В = 0',
        'когда прикажет генерал Гавс',
      ],
      answer: 1,
  },
  {
      text: 'К какой системе счисления относится число <code>FAB1</code>?',
      answers: [
        'Шестнадцатеричной',
        'Восьмиричной',
        'Двоичной',
        'Десятичной',
      ],
      answer: 0,
  },
  {
      text: 'Как в России называют символ&nbsp;<code>@</code>?',
      answers: [
        'Кошка',
        'Крыса',
        'Собака',
        'Сова',
      ],
      answer: 2,
  },
  {
      text: 'Сколько должен спать ученик средних классов в сутки?',
      answers: [
        'Зачем спать?',
        '6-7 часов',
        '8-9 часов',
        '9-10 часов',
      ],
      answer: 3,
  },
  {
      text: 'Сложный вопрос: Как зовут наших учителей по информатике?',
      answers: [
        'Надежда Михайловна и Лариса Михайловна',
        'Татьяна Николаевна и Наталья Генадиевна',
        'Екатерина Евгеньевна и Надежда Ивановна',
        'Екатерина Евгеньевна и Татьяна Николаевна',
      ],
      answer: 3,
  },
  {
      text: 'Вставте пропущенные буквы вместо звёздочек: <code>1001&nbsp;+&nbsp;1010&nbsp;=&nbsp;1**1*</code>',
      answers: [
        '10011',
        '10010',
        '11011',
        '11010',
      ],
      answer: 0,
  },
  {
      text: 'Какого типа файлов из нижепреведённых не существует?',
      answers: [
        'Текстового',
        'Графичексого',
        'Смыслового',
        'Звукового',
      ],
      answer: 2,
  },
  {
      text: 'Какая из геометричексих фигур обозначает условие при графической записи алгоритма?',
      answers: [
        'Овал',
        'Прямоугольник',
        'Ромб',
        'Тессеракт',
      ],
      answer: 2,
  },
  {
      text: 'Какой алгоритм называют линейным?',
      answers: [
        'такой, в котором в зависимости от выполнения некоторого условия совершается одна или другая последовательность шагов',
        'такой, в котором команды ваыполняются в порядке записи',
        'в котором одна и та же последовательность команд повторяется, пока выполняется установленное условие',
        'тот, что мерят линейкой',
      ],
      answer: 2,
  },
  {
      text: 'С каким исполнителем мы сталкивались на уроках для построения рисунков и чертежей в среде Кумир?',
      answers: [
        'Карандаш',
        'Чертёжник',
        'Робот',
        'Чертила',
      ],
      answer: 1,
  },
  {
      text: 'Какие расширения имеет исполняемый формат файла?',
      answers: [
        'mid, wow',
        'txt, doc, rtf',
        'gif, jpg',
        'exe, com',
      ],
      answer: 3,
  },
  {
      text: 'Какова мощность алфавита, если информационный вес одного символа <code>8 бит?</code>',
      answers: [
        '256',
        '245',
        '128',
        '210',
      ],
      answer: 0,
  },
  {
      text: 'Как называется система счисления, в которой значение цифры меняется в завсимости от её позиции в записи числа?',
      answers: [
        'Непозиционная',
        'Информационная',
        'Позиционная',
        'Неинформационная',
      ],
      answer: 2,
  },
  {
        text: 'Какая угроза здоровью может настигнуть в кабинете информатики?',
        answers: [
          'Гнев учителей',
          'Удар током',
          'Провалиться в ад',
          'Пойти в школу не позавтракав',
        ],
        answer: 1,
   },
   {
           text: 'Дан адрес почты: <code>aull@mail.uk</code>. Вычислите, из какой страны пользователь, по домену (можно и по IP)',
           answers: [
             'Украина',
             'США',
             'Великобритания',
             'КНДР',
           ],
           answer: 2,
      },

];
